b'\0xae\0xae\0x01\0x00\0xf1\0x08\0x00NN' увеличить обороты и подтвердить результат
b'\0xae\0xae\0x01\0x00\0xf2\0x08\0x00NN' уменьшить обороты и подтвердить результат
b'\0xae\0xae\0x01\0x00\0x03\0x07\0x00'
b'\0xae\0xae\0x01\0x00\0x04\0x07\0x00'
b'\0xae\0xae\0x01\0x00\0x05\0x07\0x00'
b'\0xae\0xae\0x01\0x00\0x06\0x07\0x00'
b'\0xae\0xae\0x01\0x00\0x07\0x07\0x00' остановка
b'\0xae\0xae\0x01\0x00\0x08\0x07\0x00' дальномеры
b'\0xae\0xae\0x01\0x00\0x09\0x07\0x00' энкодеры колес
b'\0xae\0xae\0x01\0x00\0x0A\0x08\0x00xx' вкл-выкл реверса
b'\0xae\0xae\0x01\0x00\0x11\0x0a\0x00xxyyzz' тормоза
   | | +--- правый 0 - выкл, 1 - вкл
   | +----- левый
   +------- передний
case 0xff:  //aeae0100ff0700 вернуть состояние КХЧ
			// 0 - currentAccelPos - обороты
			// 1 - ff - вкл передний тормоз 00 - выкл
			// 2 - ff - вкл левый тормоз    00 - выкл
			// 3 - ff - вкл правый тормоз   00 - выкл
			// 4 - ff - вкл реверс          00 - выкл
			// 5 - срабатываний энкодера в сек
			// 6 - срабатываний энкодера в мин
case 0x01: //aeae02000108xx00 повернуть в поз хх
case 0x02: //aeae0200020700 вернуть текущее положение
case 0x03: //aeae0200030900xxxx                                 // сторона: 0х00 левый
{																//          0х01 правый
	// Получено "Включить указатели поворота"					//			0х02 оба
	uint8_t side = packet[PACKET_DATA_OFFSET];					// режим:   0х00 поворот       --__--__--
	uint8_t mode = packet[PACKET_DATA_OFFSET+1];				//          0х01 затмевание    ---_---_--
                                                                //          0х02 проблеск      -___-___-
	setFlickers(side, mode);
	transmitFlickersState();
	break;
}
case 0x04: //aeae0200040700 отключить указатели поворота
case 0xFF: //aeae0200050700 вернуть состояние КРУ

